{"status":"success","totalResults":6194,"results":[{"title":"New AI technology may aid in the discovery of therapeutic agents for neurodegenerative disorders","link":"https://www.news-medical.net/news/20220725/New-AI-technology-may-aid-in-the-discovery-of-therapeutic-agents-for-neurodegenerative-disorders.aspx","keywords":null,"creator":null,"video_url":null,"description":"A research group from Nagoya University in Japan has developed an artificial intelligence for analyzing cell images that uses machine learning to predict the therapeutic effect of drugs.","content":null,"pubDate":"2022-07-26 02:40:14","image_url":"https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/6/synapse-620x480.jpg","source_id":"news-medical","country":["united states of america","united kingdom","india","australia","singapore","canada"],"category":["health"],"language":"english"},{"title":"Maya Hawke’s New Movie ‘Do Revenge’ Changed Because of ‘Stranger Things’","link":"https://www.cheatsheet.com/entertainment/maya-hawke-new-movie-do-revenge-changed-because-stranger-things.html/","keywords":["Entertainment","Movies","Actors","movies","Netflix","Stranger Things","tv shows"],"creator":["William DeLong"],"video_url":null,"description":"Maya Hawke's role in 'Stranger Things' is her most well-known. But now, she's starring in a movie. And the film's shoot changed due to her popular series.","content":"Stranger Things actor Maya Hawke was born into Hollywood. She could have chosen any career she wanted. But she followed in the footsteps of her parents, Uma Thurman and Ethan Hawke. Maya Hawke’s newest project, Do Revenge, sees her star alongside Camila Mendes in a dark comedy about two high school students who seek revenge against people who did them wrong. And writer-director Jennifer Kaytin Robinson was so keen on having the star play her role that she altered the production location and schedule around Stranger Things. Maya Hawke is best known for ‘Stranger Things’ Hawke debuted on the PBS mini-series Little Women in 2017. After that, she appeared in the Oscar-winning Quentin Tarantino flick Once Upon a Time… in Hollywood, Human Capital, and Mainstream. But most know her from her turn as Robin Buckley in Stranger Things. The actor joined the cast in season 3 and quickly became a fan favorite, returning for more adventures in season 4. As it turns out, Hawke’s time filming the latest season of the Netflix show caused Robinson quite a dilemma when choosing to cast her in Do Revenge. Maya Hawke landed ‘Do Revenge’ despite her ‘Stranger Things’ schedule Don’t get mad. Get plotting. Camila Mendes and Maya Hawke star in Do Revenge, a delicious dark comedy co-written and directed by Jennifer Kaytin Robinson — FIRST LOOK: pic.twitter.com/lI7w3Vv5Vz— Netflix (@netflix) July 20, 2022 In Do Revenge, Maya Hawke plays Eleanor, a transfer student who seeks revenge on a fellow student who made her an outcast after starting a rumor that she tried to forcibly kiss her. After a chance encounter between Eleanor and Drea (played by Mendes), the two team up and agree to help each other get back at those who jilted them. For Hawke, Robinson knew immediately she was the perfect choice for Eleanor following a Zoom call. She was so impressed that the director altered the shooting schedule and location to ensure that both Hawke and Mendes could star in her movie. “I was like, ‘That’s Eleanor, it’s got to be her. What do we do?’ It had to be Maya,” Robinson told Elle. “The movie was supposed to take place in Los Angeles. We moved it and shot it in Atlanta so we could shoot it at the same time as Stranger Things. And I rewrote it and reset it in Miami.” The writer-director continued. “They were so perfect that we legit moved the production, because if we waited for Maya after Stranger Things, we would’ve lost Cami [Mendes]. And if we had Cami in L.A., we wouldn’t have Maya. I was like, ‘Nope, it has to be both of them.’ So we moved the whole movie six weeks before production.” How will Maya Hawke follow up ‘Do Revenge’? Maya Hawke attends as Netflix Hosts “Stranger Things” Los Angeles FYSEE Event at Netflix FYSee Space on May 27, 2022 in Los Angeles, California. (Photo by Kevin Winter/Getty Images) Hawke continues to sign on to projects with big names associated with them. Later in 2022, fans will see her in Asteroid City. The film is set in the 1950s and also stars Tom Hanks, Jeff Goldblum, Scarlett Johansson, Margot Robbie, and Bryan Cranston, among many others. Wes Anderson directs. Then there’s The Kill Room. The heist movie gives Hawke a chance to appear on screen with her real-life mother, Uma Thurman, and Samuel L. Jackson in a Pulp Fiction reunion of sorts. She then stars as one of Leonard Bernstein’s kids in the Bradley Cooper-directed biopic Maestro. Additionally, expect to see Hawke return for the final season of Stranger Things. RELATED: Maya Hawke’s Ability to Talk Like ‘Phoebe Buffay on Adderall’ Inspired Her ‘Stranger Things’ Character ","pubDate":"2022-07-26 02:36:00","image_url":null,"source_id":"cheatsheet","country":["united states of america"],"category":["entertainment"],"language":"english"},{"title":"Tigers pound Manaea, Padres for 12-4 win; SD's Gore injured","link":"https://www.castanet.net/news/Sports/377141/Tigers-pound-Manaea-Padres-for-12-4-win-SD-s-Gore-injured","keywords":null,"creator":["The Canadian Press"],"video_url":null,"description":"DETROIT (AP) âe\" Eric Haase hit a grand slam off Sean Manaea, Jeimer Candelario homered twice and the Detroit Tigers routed the San Diego Padres 12-4 Monday night. Miguel Cabrera hit his 506th career homer in the sixth inning and moved past Al Simmons for 13th on the career RBI list with 1,840. Mana...","content":null,"pubDate":"2022-07-26 02:35:50","image_url":"https://www.castanet.net/content/2022/7/large/20220725220732-62df52f6ffa50bb5adfb19edjpeg_p3606818.jpg","source_id":"castanet","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Research may have found an easy, cost-effective solution for grapevine trunk diseases","link":"https://www.news-medical.net/news/20220725/Research-may-have-found-an-easy-cost-effective-solution-for-grapevine-trunk-diseases.aspx","keywords":null,"creator":null,"video_url":null,"description":"Grapevine Trunk Diseases, or GTDs, are the bane of vineyard owners worldwide, and as of 2012, were responsible for more than $1.5 billion in annual economic damages.","content":null,"pubDate":"2022-07-26 02:33:59","image_url":"https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/4/White_wine_pouring_into_glasses%2c_closeup-Africa_Studio_f13178a5bc154555a886a27103405a5d-620x480.jpg","source_id":"news-medical","country":["united states of america","united kingdom","india","australia","singapore","canada"],"category":["health"],"language":"english"},{"title":"India's first career grand slam helps Reds beat Marlins 11-2","link":"https://www.castanet.net/news/Sports/377142/India-s-first-career-grand-slam-helps-Reds-beat-Marlins-11-2","keywords":null,"creator":["The Canadian Press"],"video_url":null,"description":"CINCINNATI (AP) âe\" Jonathan India hit his first career grand slam and Brandon Drury connected for a three-run shot, helping the Cincinnati Reds pound the banged-up Miami Marlins 11-2 on Monday night. India and Donovan Solano each had three hits as last-place Cincinnati improved to 9-4 in its last 1...","content":null,"pubDate":"2022-07-26 02:30:53","image_url":"https://www.castanet.net/content/2022/7/large/20220725220720-62df4f64ffa50bb5adfb18dcjpeg_p3606819.jpg","source_id":"castanet","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Did the Pope's apology for the Catholic Church's role in residential schools go far enough? (Poll)","link":"https://www.castanet.net/news/Poll/377100/Did-the-Pope-s-apology-for-the-Catholic-Church-s-role-in-residential-schools-go-far-enough","keywords":null,"creator":null,"video_url":null,"description":"Pope Francis has apologized for the Catholic Church’s cooperation with Canada’s “devastating” policy of Indigenous residential schools, saying the forced assimilation of Native peoples into Christian society destroyed their cultures, severed their families and marginalized ge...","content":null,"pubDate":"2022-07-26 02:30:00","image_url":null,"source_id":"castanet","country":["united states of america"],"category":["top"],"language":"english"},{"title":"LGBTQ+ group demands Dave Chappelle's sold out Santa Rosa shows be canceled","link":"https://abc7news.com/translife-sonoma-county-dave-chapelle-luther-burbank-center-for-the-arts-lgbtq-community-transphobic-jokes/12072942/","keywords":["TransLife Sonoma County","Dave Chapelle Luther Burbank Center for the Arts","LGBTQ community","Dave Chapelle transphobic jokes","Dave Chapelle LiveNation","Dave Chapelle Santa Rosa","Dave Chapelle Napa","Dave Chapelle comedian"],"creator":["KGO"],"video_url":"https://vcl.abcotv.net/video/kgo/072522-kgo-5p-chappelle-protest-vid.mp4","description":"Comedian Dave Chappelle is bringing his act to Santa Rosa this week, an appearance that is not without controversy and protest. Chappelle's past jokes about the transgender community have local activists demanding the shows be canceled.","content":null,"pubDate":"2022-07-26 02:28:18","image_url":"https://cdn.abcotvs.com/dip/images/5311072_052119-ap-dave-chapelle-img.jpg","source_id":"abc7","country":["united states of america"],"category":["entertainment"],"language":"english"},{"title":"Adele announces new dates for Las Vegas residency","link":"https://www.cbsnews.com/news/adele-las-vegas-residency-new-dates/","keywords":null,"creator":null,"video_url":null,"description":"Adele earlier this year announced the residency was being postponed due to delivery delays and COVID-related issues.","content":null,"pubDate":"2022-07-26 02:26:13","image_url":null,"source_id":"cbsnews","country":["united states of america"],"category":["entertainment"],"language":"english"},{"title":"Researchers report ‘hybrid immune damping’ following SARS-CoV-2 Omicron infection","link":"https://www.news-medical.net/news/20220725/Researchers-report-e28098hybrid-immune-dampinge28099-following-SARS-CoV-2-Omicron-infection.aspx","keywords":null,"creator":null,"video_url":null,"description":"Researchers explore the impact of differential immune imprinting patterns in individuals vaccinated against COVID-19 with a history of prior infection.","content":null,"pubDate":"2022-07-26 02:26:00","image_url":"https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_720292_16587177223282087.jpg","source_id":"news-medical","country":["united states of america","united kingdom","india","australia","singapore","canada"],"category":["health"],"language":"english"},{"title":"Orioles beat Rays 5-1 thanks to 4-run 5th inning","link":"https://www.castanet.net/news/Sports/377143/Orioles-beat-Rays-5-1-thanks-to-4-run-5th-inning","keywords":null,"creator":["The Canadian Press"],"video_url":null,"description":"BALTIMORE (AP) âe\" Ryan Mountcastle hit a tiebreaking, two-run single in a four-run fifth inning that sent the Baltimore Orioles to a 5-1 victory over the Tampa Bay Rays on Monday night. Austin Voth and five Baltimore relievers kept Tampa Bay's offense from delivering the big hit. The Rays left 10 m...","content":null,"pubDate":"2022-07-26 02:24:55","image_url":"https://www.castanet.net/content/2022/7/large/20220725220724-62df5073ffa50bb5adfb193fjpeg_p3606820.jpg","source_id":"castanet","country":["united states of america"],"category":["sports"],"language":"english"}],"nextPage":1}