{"status":"success","totalResults":8871,"results":[{"title":"Brittney Griner’s Tearful WNBA Teammates Play On After Her Conviction ","link":"https://www.nytimes.com/2022/08/05/sports/basketball/brittney-griner-teammates.html","keywords":["Basketball","United States International Relations","Coaches and Managers","Hashish","Marijuana","Connecticut Sun","Phoenix Mercury","UMMC Yekaterinburg","DeShields, Diamond","Diggins, Skylar","Griner, Brittney","Jones, Jonquel"],"creator":["Kris Rhim"],"video_url":null,"description":"Brittney Griner, the Phoenix Mercury star, was convicted on drug charges in Russia. Hours later, her teammates had a game. “Nobody even wanted to play today,” one said.","content":null,"pubDate":"2022-08-05 04:31:07","image_url":"https://static01.nyt.com/images/2022/08/05/multimedia/05wnba-griner-reaction/05wnba-griner-reaction-moth.jpg","source_id":"nytimes","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"AEW Star gives a heartwarming reply to a fan who compared him to WWE Superstar The Rock","link":"https://thesportsrush.com/wwe-news-aew-star-gives-a-heartwarming-reply-to-a-fan-who-compared-him-to-wwe-superstar-the-rock/","keywords":["Wrestling","AEW","RIcky Starks","the rock","wwe"],"creator":["Ajay Morab"],"video_url":null,"description":"AEW star gives a heartwarming reply to a fan over Twitter who compares him to the WWE Superstar, The Rock. AEW and WWE are two of the biggest companies when it comes to the sport of professional wrestling. More than often there have been comparisons taking place between the wrestlers of the comparisons. The fans… The post AEW Star gives a heartwarming reply to a fan who compared him to WWE Superstar The Rock appeared first on The SportsRush.","content":"AEW star gives a heartwarming reply to a fan over Twitter who compares him to the WWE Superstar, The Rock. AEW and WWE are two of the biggest companies when it comes to the sport of professional wrestling. More than often there have been comparisons taking place between the wrestlers of the comparisons. The fans often draw the line of comparison and at times we get to see even the wrestlers get involved in a conversation regarding the same. One such incident took place recently where one of the stars of All Elite Wrestling won the heart of a fan with his reply on Twitter. The fan had compared the AEW star to the Superstar of WWE, The Rock. The AEW star who has been recently compared to the wrestler turned Hollywood actor The Rock is none other than Ricky Starks. In a recent Twitter exchange, the reigning FTW Champion responded to a fan regarding the same. On the career front, the AEW star has successfully defended the FTW Championship against former WWE star Cole Karter. Shortly after, he was confronted by Danhausen. AEW Star gives a heartwarming reply on being compared to The Rock The interaction between Starks and Danhausen has been receiving massive praise on social media. This also led to the Team Taz member claiming he has the same work ethic as The Great One. The wrestler mentioned in his tweet that he has the same energy and same work ethic as the WWE Sensation, The Rock. Same energy. Same work ethic. — Ricky Starks (@starkmanjones) July 22, 2022 It has not been the first time that Starks has been compared to the Brahma Bull. In the recent past, speaking to The PWI Podcast, the AEW wrestler has revealed his honest opinion on being compared to the WWE legend. The wrestler stated that people compare him to The Rock by the way he dresses and other stuff. The wrestler further said that he has been into wrestling not copying The Rock. He also added that he has never studied the promos of the Brahma Bull about exactly what he does. He further cleared that it all comes from how he feels and how he wants to look. Starks also said that it bothers him when people discredit his originality. “Well, the only thing that bothers me is when people try to say that I’m actually actively copying The Rock with the way I dress and all this other dumb sh–. It does p— me off because I’ve never gone into wrestling trying to copy The Rock. I’ve never studied The Rock’s promos to do exactly how he does. Everything I do, it comes from my head. It comes from how I feel and how I want to look. So when I hear people say that and discredit my originality, it does bother me a bit.” The post AEW Star gives a heartwarming reply to a fan who compared him to WWE Superstar The Rock appeared first on The SportsRush.","pubDate":"2022-08-05 04:30:14","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Research highlights the crucial role of other living primates as models for understanding human evolution","link":"https://www.news-medical.net/news/20220805/Research-highlights-the-crucial-role-of-other-living-primates-as-models-for-understanding-human-evolution.aspx","keywords":null,"creator":null,"video_url":null,"description":"A new study based in Africa reveals hidden selection against interspecies breeding in wild baboon species in a strikingly similar way to what has been described for archaic hominins. The findings, based on coupled genomic and long-term field data, highlight the crucial role of other living primates as models for understanding human evolution, particularly for phenomena that are impossible to study in our lineage alone.","content":null,"pubDate":"2022-08-05 04:28:20","image_url":"https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/DNA_Genetics-620x480.jpg","source_id":"news-medical","country":["united states of america","united kingdom","india","australia","singapore","canada"],"category":["health"],"language":"english"},{"title":"Hakeem Olajuwon once called $101 million worth former Houston Rocket’s owner a ‘Coward’ for accusing him of faking an injury","link":"https://thesportsrush.com/nba-news-300m-hakeem-olajuwon-once-called-houston-rockets-owner-a-coward-for-accusing-the-dream-of-faking-an-injury/","keywords":["Basketball","Hakeem Olajwon","Houston Rockets"],"creator":["Akash Murty"],"video_url":null,"description":"Hakeem Olajuwon is also among the top superstars of the league who put in a transfer request and saw it go to waste much like Kevin Durant. Even after a demoralising sweep by the Celtics in the first round of the Playoffs, Kevin Durant’s trade request doesn’t seem like it would do much to help… The post Hakeem Olajuwon once called $101 million worth former Houston Rocket’s owner a ‘Coward’ for accusing him of faking an injury appeared first on The SportsRush.","content":"Hakeem Olajuwon is also among the top superstars of the league who put in a transfer request and saw it go to waste much like Kevin Durant. Even after a demoralising sweep by the Celtics in the first round of the Playoffs, Kevin Durant’s trade request doesn’t seem like it would do much to help him get his talents to another contender this season. With the Nets not being able to come to terms with the Phoenix Suns, Miami Heat, or a team out of KD’s preference like the Minnesota Timberwolves, it is getting certain each passing day that Durant will still be in Brooklyn for the 2022-23 season. — Nets Videos (@SNYNets) August 4, 2022 Now, how will it turn out for the Nets to have two volatile stars leading their team from the front? It will be a big question until the season starts. But this conundrum which started due to Kyrie Irving’s antics in the last season is not going as ugly as they have in the past. And when we say past, we don’t mean the recent ones when Ben Simmons cited mental health issues to not play for the Sixers or when James Harden used his tricks to get out of Houston in 2020-21. We are talking about some old-school smack talking in the media about your team management and ownership. Also read: “I still have text messages from Kobe Bryant”: Kyle Kuzma reveals guidance he received from Black Mamba and LeBron James   Hakeem Olajuwon once called Rocket’s owner a coward in a press conference A year before the 1993-94 season which would make Hakeem Olajuwon one of the GOATs of the game and bring him two straight championships, the Houston legend had put forward a trade request in the 1992 off-season which wasn’t given any attention by Rockets ownership. It started with Hakeem missing the tail end of the 1991-92 season and his team missed a Playoffs spot by a small margin due to that. While “The Dream” insisted he wasn’t fit to play, Rocket’s medical staff cleared him to play, GM Steve Patterson accused him of faking an injury as a ploy in his attempts to renegotiate his contract. — Lachard Binkley (@BinkleyHoops) January 2, 2022 Olajuwon had demanded an apology and a trade resulting from his feud with the Rockets over his injured hamstring and his refusal to suit up for a game. But he blasted owner Charlie Thomas and general manager Steve Patterson. The future 2x NBA champ then said, “I don’t expect any apology because you are not dealing with classy people here. Charlie has been a coward, standing behind the organization. So, Steve Patterson is not even worth talking about.” However, nothing much happened afterwards due to the Rockets’ not considering anything anyone had to offer for their #1 pick of 1984, whom they chose over Michael Jordan. And in the coming years, Olajuwon would not regret his stay at all after Thomas sold the team in 1993. He’d lead them to 2 championships, and win MVP, DPOY, Finals MVPs and several more individual accolades in just the next two seasons. Also read: “Evan Mobley is hybrid of Giannis Antetokounmpo and Kevin Garnett”: The Guard Whisperer believes Cavaliers big man has unlimited potential Let’s hope it turns out well for both Durant and the Nets wherever they go on from here. Otherwise, it would be a shame for both parties to have 3 of the NBA’s top players under one roof and make nothing out of it or afterwards.   The post Hakeem Olajuwon once called $101 million worth former Houston Rocket’s owner a ‘Coward’ for accusing him of faking an injury appeared first on The SportsRush.","pubDate":"2022-08-05 04:19:20","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Aces All-Star’s last-second miss foils comeback at Dallas","link":"https://www.reviewjournal.com/sports/aces/aces-all-stars-last-second-miss-foils-comeback-at-dallas-2618425/","keywords":["Aces","Basketball","Sports","WNBA","mc-sports"],"creator":["Andy Yamashita"],"video_url":null,"description":"Aces All-Star A’ja Wilson’s last-second miss sent the Aces to a second consecutive loss, this time against the Dallas Wings","content":null,"pubDate":"2022-08-05 04:18:36","image_url":null,"source_id":"reviewjournal","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Yungblud’s ‘The Emperor’ to Serve as Hype Track For ESPN’s 2022-23 College Football Season","link":"https://www.billboard.com/music/rock/yungblud-the-emperor-espn-2022-college-football-season-anthem-1235122472/","keywords":["Music","Rock","espn","Music News","rock","sports"],"creator":["Gil Kaufman"],"video_url":null,"description":"\"I played it live for years, but never found the right time to release it until now,\" he said.","content":"Yungblud dropped the blood-pumping new single “The Emperor” on Friday (Aug. 5), which will serve double-duty as the official anthem for ESPN’s coverage of the 2022-2023 college football season, which kicks off on Aug. 27. “It’s a massive honor to have my song ‘The Emperor’ chosen as the anthem for ESPN’s college football season,” said Yungblud in a statement. “I wrote this song when I was 17; it was just an outburst of unfiltered energy that I knew would have its moment one day. I played it live for years, but never found the right time to release it until now. College football is such a massive part of American culture, and all I ever want to do is bring energy to people, so I can’t wait for the song to bring that energy to the fans and the players at the games all season.” The track with the galloping tempo and a “whoa-ooh-ooh-ooh-ooh-ooh-ooh-ooh” chant features Yungblud bellowing the urgent question “are you the emperor?” on the frenzied chorus. The team-up continues the long-running collaboration between ESPN and Interscope Records, which has included tracks from Imagine Dragons, Juice WRLD and Thirty Seconds to Mars during ESPN’s coverage of the NBA postseason, previous college football seasons and more. “In previous years we’ve selected music that matched the tone of college football. This year, with ‘Emperor,’ we partnered closely with the artist to custom build a song for football. The chants, hype, and tone match perfectly to what we expect to feel around and inside college football this season,” said Curtis Friends, senior director of sports marketing for ESPN, in a statement. “The up-tempo pace and energy of the song feels like the release of all the bottled up energy and intensity fans, players, and teams have had in anticipation for the upcoming season. It’s the perfect fit thematically for the ebbs and flows of the season that will end with one team being crowned the next ‘Emperor’ of College Football,” adds Friends of the track that will be featured within ESPN’s college football programming, promotion and games this season, as well as the network-produced college football hype trailer. In addition to Yungblud, this season college football fans will hear music from other Interscope Records/Capitol Music/Disney Music Group artists including Halsey, Ciara, Quavo & Takeoff, Tyler Hubbard, DNCE and Dreamers. Yungblud will release his self-titled third studio album on Sept. 2, which will feature the previously released singles “The Funeral,” “Memories” (feat. Willow) and “Don’t Feel Like Feeling Sad Today.” Listen to “The Emperor” here and watch the ESPN trailer below.","pubDate":"2022-08-05 04:15:23","image_url":null,"source_id":"billboard","country":["united states of america"],"category":["entertainment"],"language":"english"},{"title":"Carly Rae Jepsen Explores the World of Dating Apps in New Single ‘Beach House’","link":"https://www.rollingstone.com/music/music-news/carly-rae-jepsen-beach-house-song-1392805/","keywords":["Music","Music News","Carly Rae Jepsen","song announcement"],"creator":["Jodi Guglielmi"],"video_url":null,"description":"Catchy track explores dating in the modern world — particularly the ups and downs of trying to find love on dating apps","content":null,"pubDate":"2022-08-05 04:15:12","image_url":null,"source_id":"rollingstone","country":["united states of america"],"category":["entertainment"],"language":"english"},{"title":"“Jayson Tatum did Deuce just like Andrew Wiggins did him in the Finals!”: NBA Twitter reacts to Celtics’ star sending his 4-year-old son’s shot out of the gym","link":"https://thesportsrush.com/nba-news-jayson-tatum-did-deuce-just-like-andrew-wiggins-did-him-in-the-finals-nba-twitter-reacts-to-celtics-star-sending-his-sons-shot-out-of-the-gym/","keywords":["Basketball","boston celtics","Deuce Tatum","Jayson Tatum","NBA"],"creator":["Raahib Singh"],"video_url":null,"description":"Celtics star Jayson Tatum was recently spotted at a training camp with son Deuce, where he bullied his 4-year-old son The NBA offseason is one of the worst times of the year for people who love catching daily basketball action. The four and a half months of offseason feel like an eternity. However, this is… The post “Jayson Tatum did Deuce just like Andrew Wiggins did him in the Finals!”: NBA Twitter reacts to Celtics’ star sending his 4-year-old son’s shot out of the gym appeared first on The SportsRush.","content":"Celtics star Jayson Tatum was recently spotted at a training camp with son Deuce, where he bullied his 4-year-old son The NBA offseason is one of the worst times of the year for people who love catching daily basketball action. The four and a half months of offseason feel like an eternity. However, this is the perfect time for players to work on their skills and develop the part of the game that was lacking. Often, players host camps for kids and aspiring hoopers. This gives them an opportunity to work out with actual NBA players and learn from them. Jayson Tatum attended a camp at St. Louis with his 4-year-old son Deuce Tatum. The father-son combo is a delight for all the fans, and they sure had everyone’s attention at the camp as well. NBA players sometimes don’t know when to turn off their competitive switch. The same happened with JT as he showed no mercy to his 4-year-old. It’s a cold world in St. Louis. @jaytatum0 teaching Deuce early! @CCPBasketball @ProCamps pic.twitter.com/rfYGEFL15u — Just Lobs (@justlobs) August 4, 2022 Also Read: Jayson Tatum could make close to $300M by 2029 but there’s one condition NBA Twitter reacts to Deuce and Jayson Tatum Jayson Tatum loves his son a lot. So much that he’s already teaching the 4-year-old how hard life is. In the basketball camp, Deuce was on his way to score a basket, when JT pulled up from behind, towered over him, and blocked his shot ruthlessly. Needless to say, the clip became viral on social media, and NBA Twitter had a blast talking about the same. pic.twitter.com/WfVkqeWTq7 — ⁰⁰ (@KumingaClears) August 5, 2022 So basically Deuce is Andrew Wiggins’ grandson https://t.co/RCzPOaFWt3 — Javs (@jvayeras) August 5, 2022 This is the first thing Deuce is gonna talk about on draft night . “My dad sent my shot packin and I been grindin ever since.” LOL — Julian Mitchell (@j_mitchell25) August 4, 2022 There’s something about swatting a little kid that you just can’t resist https://t.co/vp3nmAEnDN — Jesse Wong (@RealJesseWong) August 5, 2022 At this moment it was personal. pic.twitter.com/ex3fJ1zlpg — Onlyone (@OnlyOneMondo) August 5, 2022 They need to learn from young age , NO EASY BUCKETS https://t.co/izW9QpMiFM — Alex (@feitanx__) August 5, 2022 Also Read: $25 million man Jayson Tatum beefs with 8 y/os, threatens to bust their a**es I guess Tatum’s actions won him a lot of brownie points with dad Twitter. The post “Jayson Tatum did Deuce just like Andrew Wiggins did him in the Finals!”: NBA Twitter reacts to Celtics’ star sending his 4-year-old son’s shot out of the gym appeared first on The SportsRush.","pubDate":"2022-08-05 04:13:09","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"‘NCIS: Los Angeles’: What We’re Hoping for in Season 14","link":"https://www.cheatsheet.com/entertainment/ncis-los-angeles-what-were-hoping-for-season-14.html/","keywords":["Entertainment","TV","NCIS: Los Angeles","tv shows"],"creator":["Sheiresa Ngo"],"video_url":null,"description":"Now that NCIS: Los Angeles Season 14 is on the way we can't help but think about the things we're looking forward to this season. Here's what we hope will happen.","content":"<p><em><a href=\"https://www.cheatsheet.com/tag/ncis-los-angeles/\">NCIS: Los Angeles</a></em> Season 14 will be here before we know it. Here are some of the things we hope will happen for <a href=\"https://www.cheatsheet.com/entertainment/ncis-los-angeles-kensi-deeks-married.html/\">Kensi and Deeks</a>, Sam, Callen, and Hetty. </p> <h2 id=\"h-kensi-and-deeks-won-t-have-any-problems-as-foster-parents\">Kensi and Deeks won’t have any problems as foster parents</h2> <figure class=\"wp-block-image size-custom-image-1200\"><img width=\"3000\" height=\"2272\" src=\"https://www.cheatsheet.com/wp-content/uploads/2022/08/NCIS-Los-Angeles-cast.jpg?w=1200\" alt=\"The cast of NCIS: Los Angeles takes a walk.\" class=\"wp-image-3119172\" srcset=\"https://www.cheatsheet.com/wp-content/uploads/2022/08/NCIS-Los-Angeles-cast.jpg 3000w, https://www.cheatsheet.com/wp-content/uploads/2022/08/NCIS-Los-Angeles-cast.jpg?w=640&h=485 640w, https://www.cheatsheet.com/wp-content/uploads/2022/08/NCIS-Los-Angeles-cast.jpg?w=768&h=582 768w, https://www.cheatsheet.com/wp-content/uploads/2022/08/NCIS-Los-Angeles-cast.jpg?w=1024&h=776 1024w, https://www.cheatsheet.com/wp-content/uploads/2022/08/NCIS-Los-Angeles-cast.jpg?w=1536&h=1163 1536w, https://www.cheatsheet.com/wp-content/uploads/2022/08/NCIS-Los-Angeles-cast.jpg?w=2048&h=1551 2048w, https://www.cheatsheet.com/wp-content/uploads/2022/08/NCIS-Los-Angeles-cast.jpg?w=1200&h=909 1200w, https://www.cheatsheet.com/wp-content/uploads/2022/08/NCIS-Los-Angeles-cast.jpg?w=79&h=60 79w, https://www.cheatsheet.com/wp-content/uploads/2022/08/NCIS-Los-Angeles-cast.jpg?w=150&h=114 150w\" sizes=\"(max-width: 3000px) 100vw, 3000px\" /><figcaption>The NCIS Los Angeles cast | Michael Yarish/CBS via Getty Images</figcaption></figure> <p>Although Kensi and Deeks aced their evaluation to foster Rosa, they still have a lot of concerns. One big worry they have is about their jobs and how that will affect Rosa. It can be a dangerous job and it’s time consuming, so they fear that could become an issue down the road.</p> <p>One thing we know is that Kensi and Deeks have the support of their work family. At the end of the season 13 finale, they held a celebration on the beach for the new foster parents. The party had food, drinks, and balloons spelling “Rosa” hanging overhead. Kilbride (<a href=\"https://www.cheatsheet.com/entertainment/ncis-los-angeles-gerald-mcraney-officially-joins-cast-what-is-actor-known-for.html/\">played by Gerald McRaney</a>) wanted Kensi and Deeks to know that he and the entire team are behind them.</p> <h2>Callen and Anna will get married</h2> <figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\"> <div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"NCIS: Los Angeles - Love Birds\" width=\"925\" height=\"520\" src=\"https://www.youtube.com/embed/F_g7hXP7XCo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div> </div></figure> <p>During the <em>NCIS: Los Angeles</em> Season 13 finale, Callen proposed to Anna (<a href=\"https://www.cheatsheet.com/entertainment/ncis-los-angeles-anna-kolcheck.html/\">played by Bar Paly</a>), and she accepted. At first, Anna’s father, Arkady, wasn’t thrilled with the idea of them getting married (he doesn’t believe marriage works). However, he warmed up to the idea after Callen almost got killed.</p> <p>Although we’re hoping Anna and Callen get hitched and ride off into the sunset, we have some concerns. Something tells us things won’t be easy for the couple. You wouldn’t have a show without some drama, now, would you?</p> <p>Will Anna get cold feet? Will Callen get kidnapped again? Hopefully we’ll see their wedding this season and nothing goes wrong.  </p> <h2>Sam’s living arrangement with his father works out</h2> <p>Sam’s father has Alzheimer’s disease, and he has reached a point where he can no longer live alone. Sam (<a href=\"https://www.cheatsheet.com/entertainment/ncis-los-angeles-ll-cool-j-career.html/\">played by LL Cool J</a>) decided it would be best if he bought a house so his father could live with him. So far, things have been challenging. Sam’s father misses his independence. He’s also still grieving the loss of his wife.</p> <p>Sam’s father is grateful for his son’s help, but he’s also used to doing things on his own. We’re hoping that things will settle down and Sam and his father will learn how to live together again.</p> <h2>Hetty will return for Season 14</h2> <p>We haven’t seen Hetty for most of Season 13. Our biggest wish is that Hetty returns to the series full time. It hasn’t been the same without her. Part of the reason <a href=\"https://www.cheatsheet.com/entertainment/ncis-los-angeles-linda-hunt-leaving-the-show.html/\">Linda Hunt (the actress who plays Hetty</a>) hasn’t been around is because of the pandemic. The producers are doing everything they can to make sure she stays healthy.</p> <p>“Linda was away a lot more this season because of COVID and us trying to keep her safe,” <em>NCIS: Los Angeles</em> showrunner R. Scott Gemmill told <a href=\"https://tvline.com/2022/04/25/ncis-los-angeles-season-14-linda-hunt-returns-hetty/\" target=\"_blank\" rel=\"noreferrer noopener\">TV Line</a> around the time season 12 wrapped.</p> <p>“And then finally, Linda had both her vaccines, she was feeling great, and she came back [for the season 12 finale]. And she was so happy to be back. She had been gone for so long and hadn’t really interacted with anyone, so she was just so thrilled to be back on set.” Hopefully, we will see Hunt during <em>NCIS: Los Angeles</em> Season 14.</p> <p>Follow Sheiresa Ngo on <a href=\"https://twitter.com/SheiresaNgo?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\" target=\"_blank\" rel=\"noreferrer noopener\">Twitter</a>.</p> <p><strong>RELATED</strong>: <a href=\"https://www.cheatsheet.com/entertainment/ncis-los-angeles-who-plays-admiral-kilbride-assistant-shyla.html/\">‘NCIS: Los Angeles’: Who Plays Admiral Kilbride’s Assistant, Shyla?</a></p>","pubDate":"2022-08-05 04:12:19","image_url":null,"source_id":"cheatsheet","country":["united states of america"],"category":["entertainment"],"language":"english"},{"title":"WATCH: Video shows wrong-way driver going into parade crowd in New Mexico","link":"https://www.kcra.com/article/wrong-way-driver-parade-crowd-new-mexico/40813642","keywords":null,"creator":null,"video_url":null,"description":"The incident left multiple people, including two police officers, injured.","content":null,"pubDate":"2022-08-05 04:12:00","image_url":"https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/screen-shot-2022-08-04-at-11-52-24-pm-1659671553.png","source_id":"kcra","country":["united states of america"],"category":["top"],"language":"english"}],"nextPage":1}