{"status":"success","totalResults":4393,"results":[{"title":"Mets’ Jacob deGrom throws bullpen at Citi Field as he awaits next rehab start","link":"https://nypost.com/2022/07/25/mets-jacob-degrom-appears-at-citi-field-as-he-awaits-next-rehab-start/","keywords":null,"creator":["Mike Puma"],"video_url":null,"description":"Jacob deGrom’s cameo at Citi Field consisted of a bullpen session Sunday, as he awaits his next minor-league rehab start.","content":"Jacob deGrom’s cameo at Citi Field consisted of a bullpen session Sunday, as he awaits his next minor-league rehab start.","pubDate":"2022-07-25 04:10:46","image_url":"https://nypost.com/wp-content/uploads/sites/2/2022/07/1T2A7144-1-1.jpg?quality=90&strip=all","source_id":"nypost","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"411’s WWE Rivals Report: Episode Three: “Stone Cold” Steve Austin vs. The Rock","link":"https://411mania.com/wrestling/411s-wwe-rivals-report-episode-three-stone-cold-steve-austin-vs-the-rock/","keywords":null,"creator":["RobertLeightyJr"],"video_url":null,"description":"Rock/Austin. All that needs said! The post 411’s WWE Rivals Report: Episode Three: “Stone Cold” Steve Austin vs. The Rock appeared first on 411MANIA.","content":null,"pubDate":"2022-07-25 04:07:19","image_url":null,"source_id":"411mania","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Resurrection Review","link":"https://411mania.com/movies/resurrection-review/","keywords":["Resurrection"],"creator":["Jeremy Thomas"],"video_url":null,"description":"Jeremy Thomas checks in with his review of the new psychological thriller Resurrection starring Rebecca Hall and Tim Roth. The post Resurrection Review appeared first on 411MANIA.","content":null,"pubDate":"2022-07-25 04:03:40","image_url":null,"source_id":"411mania","country":["united states of america"],"category":["entertainment"],"language":"english"},{"title":"Ask 411 Wrestling: Will Pro Wrestling Move On From Vince McMahon?","link":"https://411mania.com/wrestling/ask-411-wrestling-will-pro-wrestling-move-on-from-vince-mcmahon/","keywords":["Ask 411 Wrestling","Vince McMahon","WWE"],"creator":["RyanByers"],"video_url":null,"description":"Will pro wrestling move on from Vince McMahon? Ryan Byers answers that question and more in the latest Ask 411 Wrestling. The post Ask 411 Wrestling: Will Pro Wrestling Move On From Vince McMahon? appeared first on 411MANIA.","content":null,"pubDate":"2022-07-25 04:03:08","image_url":null,"source_id":"411mania","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Myanmar executes NLD lawmaker, 3 other political detainees","link":"https://news.yahoo.com/myanmar-executes-nld-lawmaker-3-040127787.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-07-25 04:01:27","image_url":null,"source_id":"yahoo","country":["united states of america"],"category":["top"],"language":"english"},{"title":"Former Oregon Ducks star Raevyn Rogers places 6th in 800-meter at world championships","link":"https://www.kgw.com/article/sports/track/raevyn-rogers-800-meter-world-championships/283-a08efe18-7160-4c7a-bd48-3458db0d2398","keywords":["track","local","sports"],"creator":null,"video_url":null,"description":"Rodgers ran two laps around the track at Hayward Field during Sunday's final with a time of 1:58.26. Fellow team USA runner Athing Mu won gold.","content":null,"pubDate":"2022-07-25 04:01:02","image_url":"https://media.tegna-media.com/assets/KGW/images/c74ff804-1482-489d-9ed7-20d864fd6783/c74ff804-1482-489d-9ed7-20d864fd6783_750x422.jpg","source_id":"kgw","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"I finally gave this Apple TV Plus show a shot — and it’s the best thing I’ve seen in years","link":"https://www.tomsguide.com/opinion/i-finally-gave-this-apple-tv-plus-show-a-shot-and-its-the-best-thing-ive-seen-in-years","keywords":null,"creator":null,"video_url":null,"description":"For All Mankind is one of the best shows on TV, and it deserves way more attention than it gets.","content":null,"pubDate":"2022-07-25 04:00:02","image_url":"http://cdn.mos.cms.futurecdn.net/nvvSVWFGMbuHL32ZridLUL.jpg","source_id":"tomsguide","country":["united states of america"],"category":["technology"],"language":"english"},{"title":"Daily Schmankerl: Return of the Crack;  Arsenal eyeing Bayern Munich star; Tottenham Hotspur wanted Matthijs de Ligt before Bayern move; Erling Haaland warns of potent Jack Grealish partnership; Manchester United wants Benjamin Šeško; and MORE!","link":"https://www.bavarianfootballworks.com/2022/7/25/23276619/arsenal-bayern-munich-tottenham-hotspur-matthijs-de-ligt-haaland-grealish-manchester-united-sesko","keywords":null,"creator":["CSmith1919"],"video_url":null,"description":null,"content":"Photo by Justin Casterline/Getty Images Hey...I’m back! What the hell happened? (Bavarian Football Works) I went on one measly vacation and the entire direction of Bayern Munich’s future changed in a massive way. Before I left for Disney World, Robert Lewandowski was not yet officially a member of FC Barcelona, Matthijs de Ligt was still a Dutchman in Italy, Chris Richards was hoping to break through in Bavaria, and Mathys Tel was some French kid with potential. Moreover, we had not even had a sneak peek at what the 2022/23 version of Julian Nagelsmann’s Bayern Munich might look like. Now, after my brain was beaten around by the sun and some rides, I have to come back and process all of this? Thanks Brazzo! Anyway, as I try to piece all of this together (I feel like I’m on crack right now), I’m sure some crazy thought will start brewing in my brain, so look for those soon. Big thanks to everyone on the BFW staff for covering for me as well. I guess it’s time to get back to covering this team from top-to-bottom...let’s do it! Gunners want Sané? (Give Me Sport) There are conflicting reports out floating around stating that Arsenal FC might want Bayern Munich star Leroy Sané: Arsenal are not in negotiations to sign Bayern Munich winger Leroy Sané, says transfer expert Fabrizio Romano. The 26-year-old has been linked with a move to the Emirates, and while Romano thinks his situation could be one to keep a close eye on in August, the journalist has told GIVEMESPORT that Bayern’s current plan is to retain him. According to Bild (via Mundo Deportivo), Arsenal are interested in signing Sané as Mikel Arteta looks to bolster his options out wide. Raphinha was thought to have been the Spaniard’s primary target for the wing, but the Gunners were unable to agree a fee with Leeds United and the 25-year-old has since gone on to join Barcelona. It leaves Arsenal now needing to consider other options like Sané. This report certainly does not make it fully clear that Arsenal would be willing to buck up for Sané, but one thing is starting to become clear: The Germany international might have a hard time breaking into Julian Nagelsmann’s lineup. With Thomas Müller, Sadio Mané, Kingsley Coman, Serge Gnabry, Jamal Musiala, Gabriel Vidovic, and Paul Wanner among the attacking options that Nagelsmann has at his disposal, Sané’s place on the squad is far from secure, The recent news that Wanner will likely get a look as a left-wing represents one more potential hurdle for Sané, who has been good since moving over from Manchester City, but not quite lived up to the expectations that were placed on him. It seems very unlikely that Bayern Munich would be willing to sell Sané just yet, but it is also hard to imagine that the 26-year-old will stay happy if he is relegated to a reserve role on the squad. Bavarian Podcast Works: Weekend Warm-up Podcast Season 2, Episode 3 — The Robert Lewandowski saga at Bayern Munich is finally over! Matthijs de Ligt is here! Leon Goretzka is injured; Serge Gnabry will stay on, flares in the stadium and MORE! Bayern Munich made some big splashes in the transfer market in terms of buying and selling. Many important events occurred this week and we reflect on some of them in this podcast. Here is what we have for this episode: Reflecting on the Robert Lewandowski transfer and his departure Discussing Robert Lewandowski’s legacy at Bayern Will Bayern change their style of play due to Lewandowski’s departure? Where will the goals come from? Lewandowski’s stature in world football Matthijs de Ligt arrives! What does this mean about Bayern’s defense? Who will be the new leader of the defense? Leon Goretzka is injured! What will Bayern do in this situation? Serge Gnabry extends! Does the decision to keep him make sense? Why the DFB fining Bayern and Bochum for flares in the stands makes sense A note about Bayern’s spending this summer Reflections on a possible Konrad Laimer transfer A small spoiler about Better Call Saul :) Spurs made late inquiry on De Ligt (The Boot Room) Before he made the move from Juventus to Bayern Munich, Matthijs de Ligt drew a serious inquiry from Tottenham Hotspur: Tottenham Hotspur spoke to Juventus to see if a deal for Matthijs De Ligt would be possible before his move to Bayern Munich, according to a report from Calciomercato. De Ligt made one of the most stunning moves of the window so far. The Dutchman joined Bayern Munich in a £68 million deal after three years in Turin. The 22-year-old did not always have the best time with Juve following his move from Ajax. But there is absolutely no doubt that he is one of the most talented young defenders around right now. And it seems that there was some interest in bringing him to the Premier League this summer. Fabio Paratici knows De Ligt from his own time with Juventus. Haaland feeling confident at City (Manchester Evening News) I’ll just say it — with Erling Haaland — I think Pep Guardiola’s Manchester City is the Champions League favorite. That’s not exactly going out on a limb, but I think if Haaland does not totally infuriate Guardiola with his sometimes lackadaisical play, this could be one of the truly great teams in Europe this season. Haaland seems to be feeling that way as well and is loving his partnership with Jack Grealish. A partnership Jack...the two of you working together. Got it? Whatever the case, here is what Haaland had to say. “It was really good. Good to get started again [after going] without playing football, so it’s a good feeling. As you probably know, I have been watching a lot of City games for the last years and they have been without a striker. Of course, I have been seeing myself in these kinds of positions, so I am not surprised,” Haaland said. “(Grealish) is good. He has to get better and I have to get better, but this is a good link-up and I like the vibe around him, so it’s going to be fun.” Haaland also had this to say about finally beating Bayern Munich (a win is a win...even in a friendly): Haaland: “First time winning against Bayern, it was about time after 7 losses in a row\"[ @footballdaily]pic.twitter.com/02kpIoJppU— Bayern & Die Mannschaft (@iMiaSanMia_en) July 24, 2022 ICYMI: Vote for Bavarian Podcast Works! (Bavarian Football Works) It’s our pleasure to announce that Bavarian Podcast Works has been nominated for the “Best Club Podcast” by World Soccer Talk. That’s right your (hopefully) favorite Bayern Munich podcast network is up for an award. While we are humbled and honored that we have not chased everyone away, we could use your help in securing the trophy. That’s right...you can vote! Help support BFW’s quest to be the best, by checking out this link and giving us a vote (or INNN will hunt you down): World Soccer Talk Awards — Best Club Podcast Bear in mind, we didn’t nominate ourselves or anything like that for this award...somebody likes us! We’ve put a lot of hard work into helping the podcast network grow and evolve over the years. We’d love to bring home the gold here and frankly we have not been this fired up over a competition since the Bunducksliga was at its peak. Voting closes at midnight EST on July 31, 2022. (Direct link: https://worldsoccertalk.com/best-club-podcast-2022-world-soccer-talk-awards) ONLY 7 DAYS LEFT, COME ON LADS WE CAN DO THIS! United keep tabs on Šeško? (@FabrizioRomano) One of the names that Bayern Munich was linked to prior to Robert Lewandowski’s exit was Red Bull Salzburg striker Benjamin Šeško. Now, however, it appears that Manchester United is keen on the youngster: Manchester United are well informed on Salzburg talent Benjamin Šeško. He’s one of the players monitored, considered ‘really talented’ - but it’s not imminent or advanced deal as of now. #MUFCMan Utd are aware of Šeško as other clubs are informed too, including Newcastle. pic.twitter.com/d5t1BUrc1W— Fabrizio Romano (@FabrizioRomano) July 24, 2022 Šeško is an intriguing name that could remerge in the future for Bayern Munich. The Slovenian has a blend of speed and skill that could make him a handful for years to come. Alaba, Lewy do some bonding (@FCBarcelona_es) Robert Lewandowski and David Alaba got a chance to chat a little during FC Barcelona’s 1-0 preseason win over Real Madrid: Fútbol ❤️ pic.twitter.com/Jye961Qb21— FC Barcelona (@FCBarcelona_es) July 24, 2022","pubDate":"2022-07-25 04:00:00","image_url":null,"source_id":"bavarianfootballworks","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Wordle Today #401 Hint And Answer Monday, July 25th","link":"https://www.forbes.com/sites/erikkain/2022/07/25/wordle-today-401-hint-and-answer-monday-july-25th/","keywords":["Games","/games","Innovation","/innovation","Games","/games","Business","/business","Hollywood & Entertainment","/hollywood-entertainment","innovation","games"],"creator":["Erik Kain"," Senior Contributor"],"video_url":null,"description":"Here's today's Wordle answer plus a helpful hint for word of the day #401, July 25th 2022.","content":"Here's today's Wordle answer plus a helpful hint for word of the day #401, July 25th 2022.","pubDate":"2022-07-25 04:00:00","image_url":"https://imageio.forbes.com/specials-images/imageserve/620705916546f0d3cad9ed04/0x0.jpg?width=960","source_id":"forbes","country":["united states of america"],"category":["technology"],"language":"english"},{"title":"Amber Marshall Discusses How the ‘Heartland’ Male Characters Aren’t Overly Machismo","link":"https://www.cheatsheet.com/entertainment/amber-marshall-discusses-how-heartland-male-characters-arent-overly-machismo.html/","keywords":["Entertainment","TV","Netflix","tv shows"],"creator":["Eryn Murphy"],"video_url":null,"description":"In an interview on the 'Hallmarkies Podcast,' actor Amber Marshall discussed the male characters on the CBC series 'Heartland.'","content":"Heartland first premiered on CBC in 2007. With its 16th season currently filming, the long-running TV show has a dedicated fan base. Amber Marshall plays the show’s main character Amy Fleming, a young woman who tries to help traumatized horses through natural horsemanship. While Amy is the show’s central character, Heartland also has multiple popular male characters. In a recent interview on the Hallmarkies Podcast, Marshall discussed the importance of the male characters on Heartland. Shaun Johnston and Chris Potter in ‘Heartland’ | Courtesy of CBC ‘Heartland’ is about Amy Fleming’s family Heartland is a Canadian drama, and new episodes air on CBC. The TV show is based on a book series of the same name by Lauren Brooke. On Heartland, Amy lives on her family’s ranch Heartland Ranch with her family. Graham Wardle played Amy’s husband, Ty Borden. When Wardle decided to leave the show, Ty died following complications of a gunshot wound in season 14. On Heartland Ranch, Amy lives with her and Ty’s daughter Lyndy (Ruby and Emmanuella Spencer), her older sister Lou (Michelle Morgan), and her grandfather Jack Bartlett (Shaun Johnston). Amy and Lou’s father, Tim Fleming (Chris Potter), is also a main character on the show. RELATED: Scott Disick’s Former Modeling Career Included Book Covers Amber Marshall thinks the male characters on ‘Heartland’ are ‘important’ On the Hallmarkies Podcast, Marshall was asked about the male characters on Heartland, primarily Jack and Tim. Both characters are ranchers and former rodeo competitors, but Tim and Jack also have strong paternal instincts. “There’s that nice balance of ‘OK, we gotta go fix a fence, and we’re gonna ride a bronc, and we have the rodeo school. But yes, of course, I will look after two-year-old, three-year-old.’ It’s like a hands down. And you see those sweet, caring, genuine moments, which I do, I think is really important,” Marshall said on the podcast. Marshall also thinks the family’s overall “dynamic” is important representation on TV. “And we always have the words of wisdom from Grandpa. And I think everyone who watches the show always wishes that they had a grandpa like Jack. Or there’s just those characters that are so relatable. Or maybe they do have a grandpa like Jack, and I think that having that family dynamic that sits down every night to have dinner together is something that’s kind of getting lost a little bit in today’s society,” said Marshall. RELATED: Why ‘Heartland’ Season 15 Used an Almost Entirely New Crew and the Challenges That Presented Amber Marshall appreciates the Fleming family structure Speaking on the Hallmarkies Podcast, Marshall expanded on her appreciation for how Amy’s family is portrayed on Heartland. “Everybody’s so, they’re just in a rush. There’s way too many devices in the house. People are watching things in different rooms. And so, that’s one thing I love about Heartland is it kind of, it brings back that Sunday night family dinner and a show,” said Marshall. She continued, “Family is very important and spending time together, not just all on different devices and different rooms and things like that. Just being able to sit down and have a nice dinner together and talk about your day and things like that.” RELATED: ‘When Calls the Heart’: Why Team Nathan Fans Need to Stream ‘Heartland’ on Netflix","pubDate":"2022-07-25 03:57:58","image_url":null,"source_id":"cheatsheet","country":["united states of america"],"category":["entertainment"],"language":"english"}],"nextPage":1}